OpenEPaperLink/OpenEPaperLink/ESP32_AP-Flasher/src/web.cpp
    server.on("/save_apcfg", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (request->hasParam("alias", true)) {
            String aliasValue = request->getParam("alias", true)->value();
            size_t aliasLength = aliasValue.length();
            if (aliasLength > 31) aliasLength = 31;
            aliasValue.toCharArray(config.alias, aliasLength + 1);
            config.alias[aliasLength] = '\0';
        }


        if (request->hasParam("channel", true)) {
            config.channel = static_cast<uint8_t>(request->getParam("channel", true)->value().toInt());
        }
        if (request->hasParam("subghzchannel", true)) {
            config.subghzchannel = static_cast<uint8_t>(request->getParam("subghzchannel", true)->value().toInt());
        }
        if (request->hasParam("led", true)) {
            config.led = static_cast<uint8_t>(request->getParam("led", true)->value().toInt());
            updateBrightnessFromConfig();
            // sendChannelPower also carries the LED flag, pushing the change to
            // the C6 live rather than only at the next reboot.
            sendChannelPower(&curChannel);
        }
        if (request->hasParam("tft", true)) {
            config.tft = static_cast<uint8_t>(request->getParam("tft", true)->value().toInt());
            updateBrightnessFromConfig();
        }
        if (request->hasParam("language", true)) {
            config.language = static_cast<uint8_t>(request->getParam("language", true)->value().toInt());
            updateLanguageFromConfig();
        }
        if (request->hasParam("maxsleep", true)) {
            config.maxsleep = static_cast<uint8_t>(request->getParam("maxsleep", true)->value().toInt());
        }
        if (request->hasParam("stopsleep", true)) {
            config.stopsleep = static_cast<uint8_t>(request->getParam("stopsleep", true)->value().toInt());
        }
        if (request->hasParam("preview", true)) {
            config.preview = static_cast<uint8_t>(request->getParam("preview", true)->value().toInt());
        }
        if (request->hasParam("nightlyreboot", true)) {
            config.nightlyreboot = static_cast<uint8_t>(request->getParam("nightlyreboot", true)->value().toInt());
        }
        if (request->hasParam("lock", true)) {
            config.lock = static_cast<uint8_t>(request->getParam("lock", true)->value().toInt());
        }
        if (request->hasParam("ble", true)) {
            config.ble = static_cast<uint8_t>(request->getParam("ble", true)->value().toInt());
        }
        if (request->hasParam("sleeptime1", true)) {
            config.sleepTime1 = static_cast<uint8_t>(request->getParam("sleeptime1", true)->value().toInt());
            config.sleepTime2 = static_cast<uint8_t>(request->getParam("sleeptime2", true)->value().toInt());
        }
        if (request->hasParam("wifipower", true)) {
            config.wifiPower = static_cast<uint8_t>(request->getParam("wifipower", true)->value().toInt());
            WiFi.setTxPower(static_cast<wifi_power_t>(config.wifiPower));
        }
        if (request->hasParam("timezone", true)) {
            strncpy(config.timeZone, request->getParam("timezone", true)->value().c_str(), sizeof(config.timeZone) - 1);
            config.timeZone[sizeof(config.timeZone) - 1] = '\0';
            setenv("TZ", config.timeZone, 1);
            tzset();
        }
        if (request->hasParam("discovery", true)) {
            config.discovery = static_cast<uint8_t>(request->getParam("discovery", true)->value().toInt());
        }
        if (request->hasParam("showtimestamp", true)) {
            config.showtimestamp = static_cast<uint8_t>(request->getParam("showtimestamp", true)->value().toInt());
        }
        if (request->hasParam("repo", true)) {
            config.repo = request->getParam("repo", true)->value();
        }
        if (request->hasParam("env", true)) {
            config.env = request->getParam("env", true)->value();
        }
        /* Pins used only while flashing a co-processor. Normal operation
           keeps the compile time pinout, so a wrong value here can cost a
           flash attempt but never the running access point. -1 means the
           board has no such pin. */
        {
            struct { const char *name; int8_t *field; } flashPins[] = {
                {"flashpin_sws", &config.flashPinSws},
                {"flashpin_reset", &config.flashPinReset},
                {"flashpin_txd", &config.flashPinTxd},
                {"flashpin_rxd", &config.flashPinRxd},
                {"flashpin_prog", &config.flashPinProg},
                {"flashpin_dbgtxd", &config.flashPinDbgTxd},
                {"flashpin_dbgrxd", &config.flashPinDbgRxd},
            };
            for (auto &p : flashPins) {
                if (!request->hasParam(p.name, true)) continue;
                long v = request->getParam(p.name, true)->value().toInt();
                if (v < -1 || v > 48) continue;   /* outside any ESP32 GPIO */
                *p.field = (int8_t)v;
            }
        }

        saveAPconfig();
        setAPchannel();
        request->send(200, "text/plain", "Ok, saved");
    });

    // Allow external time sync (e.g., from Home Assistant) without Internet
    // Usage: POST /set_time with form field 'epoch' (UNIX time seconds)
    server.on("/set_time", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (request->hasParam("epoch", true)) {
            time_t epoch = static_cast<time_t>(request->getParam("epoch", true)->value().toInt());
            if (epoch > 1600000000) { // basic sanity check (~2020-09-13)
                struct timeval tv;
                tv.tv_sec = epoch;
                tv.tv_usec = 0;
                settimeofday(&tv, nullptr);
                logLine("Time set via /set_time");
                wsSendSysteminfo();
                request->send(200, "text/plain", "ok");
                return;
            } else {
                request->send(400, "text/plain", "invalid epoch");
                return;
            }
        }
        request->send(400, "text/plain", "missing 'epoch'");
    });

