OpenEPaperLink/OpenEPaperLink/ESP32_AP-Flasher/src/web.cpp
    server.onNotFound([](AsyncWebServerRequest *request) {
        if (request->url() == "/" || request->url() == "index.htm") {
            request->send(200, "text/html", "index.html not found. Did you forget to upload the littlefs partition?");
            return;
        }
        request->send(404);
    });

    server.serveStatic("/", *contentFS, "/www/").setDefaultFile("index.html");

    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "content-type");

    server.begin();
}

#define UPLOAD_BUFFER_SIZE 32768

struct UploadInfo {
    String filename;
    uint8_t buffer[UPLOAD_BUFFER_SIZE];
    size_t bufferSize;
};

void doImageUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    String uploadfilename;
    if (!index) {
        if (config.runStatus != RUNSTATUS_RUN) {
            request->send(409, "text/plain", "Come back later");
            return;
        }
        if (!request->hasParam("mac", true)) {
            request->send(400, "text/plain", "parameters incomplete");
            return;
        }
        logLine("http imageUpload " + uploadfilename);

        uploadfilename = request->getParam("mac", true)->value() + "_" + String(millis()) + ".jpg";
        File file = contentFS->open("/temp/" + uploadfilename, "w");
        file.close();
        Serial.println("upload started " + uploadfilename);

        UploadInfo *uploadInfo = new UploadInfo{uploadfilename, {}, 0};
        request->_tempObject = (void *)uploadInfo;
    }

    UploadInfo *uploadInfo = static_cast<UploadInfo *>(request->_tempObject);

    if (uploadInfo != nullptr) {
        uploadfilename = uploadInfo->filename;

        if (len) {
            if (uploadInfo->bufferSize + len <= UPLOAD_BUFFER_SIZE) {
                memcpy(&uploadInfo->buffer[uploadInfo->bufferSize], data, len);
                uploadInfo->bufferSize += len;
            } else {
                xSemaphoreTake(fsMutex, portMAX_DELAY);
                File file = contentFS->open("/temp/" + uploadfilename, "a");
                if (file) {
                    file.write(uploadInfo->buffer, uploadInfo->bufferSize);
                    file.close();
                    uploadInfo->bufferSize = 0;
                    xSemaphoreGive(fsMutex);
                } else {
                    xSemaphoreGive(fsMutex);
                    logLine("Failed to open file for appending: " + uploadfilename);
                }

                memcpy(uploadInfo->buffer, data, len);
                uploadInfo->bufferSize = len;
            }
        }

        if (final) {
            if (uploadInfo->bufferSize > 0) {
                xSemaphoreTake(fsMutex, portMAX_DELAY);
                File file = contentFS->open("/temp/" + uploadfilename, "a");
                if (file) {
                    file.write(uploadInfo->buffer, uploadInfo->bufferSize);
                    file.close();
                    xSemaphoreGive(fsMutex);
                } else {
                    xSemaphoreGive(fsMutex);
                    logLine("Failed to open file for appending: " + uploadfilename);
                }
                request->_tempObject = nullptr;
                delete uploadInfo;
            }

            if (request->hasParam("mac", true)) {
                String dst = request->getParam("mac", true)->value();
                uint8_t mac[8];
                if (hex2mac(dst, mac)) {
                    tagRecord *taginfo = tagRecord::findByMAC(mac);
                    if (taginfo != nullptr) {
                        uint8_t dither = 1;
                        if (request->hasParam("dither", true)) {
                            dither = request->getParam("dither", true)->value().toInt();
                        }
                        if (request->hasParam("alias", true)) {
                            taginfo->alias = request->getParam("alias", true)->value();
                        }
                        if (request->hasParam("rotate", true)) {
                            taginfo->rotate = atoi(request->getParam("rotate", true)->value().c_str());
                        }
                        if (request->hasParam("lut", true)) {
                            taginfo->lut = atoi(request->getParam("lut", true)->value().c_str());
                        }
                        if (request->hasParam("invert", true)) {
                            taginfo->invert = atoi(request->getParam("invert", true)->value().c_str());
                        }
                        uint32_t ttl = 0;
                        if (request->hasParam("ttl", true)) {
                            ttl = request->getParam("ttl", true)->value().toInt();
                        }
                        uint8_t preload = 0;
                        uint8_t preloadlut = 0;
                        uint8_t preloadtype = 0;
                        if (request->hasParam("preloadtype", true)) {
                            preload = 1;
                            preloadtype = request->getParam("preloadtype", true)->value().toInt();
                            if (request->hasParam("preloadlut", true)) {
                                preloadlut = request->getParam("preloadlut", true)->value().toInt();
                            }
                        }
                        taginfo->modeConfigJson = "{\"filename\":\"/temp/" + uploadfilename + "\",\"timetolive\":\"" + String(ttl) + "\",\"dither\":\"" + String(dither) + "\",\"delete\":\"1\", \"preload\":\"" + String(preload) + "\", \"preload_lut\":\"" + String(preloadlut) + "\", \"preload_type\":\"" + String(preloadtype) + "\"}";
                        if (request->hasParam("contentmode", true)) {
                            taginfo->contentMode = request->getParam("contentmode", true)->value().toInt();
                        } else {
                            taginfo->contentMode = 24;
                        }
                        Serial.println("upload finished " + uploadfilename);
                        taginfo->nextupdate = 0;
                        wsSendTaginfo(mac, SYNC_USERCFG);
                        request->send(200, "text/plain", "Ok, saved");
                    } else {
                        request->send(400, "text/plain", "mac not found");
                    }
                }
            }
        }
    }
}

void doJsonUpload(AsyncWebServerRequest *request) {
    if (config.runStatus != RUNSTATUS_RUN) {
        request->send(409, "text/plain", "come back later");
        return;
    }
    if (request->hasParam("mac", true) && request->hasParam("json", true)) {
        String dst = request->getParam("mac", true)->value();
        uint8_t mac[8];
        if (hex2mac(dst, mac)) {
            xSemaphoreTake(fsMutex, portMAX_DELAY);
            File file = contentFS->open("/current/" + dst + ".json", "w");
            if (!file) {
                request->send(400, "text/plain", "Failed to create file");
                xSemaphoreGive(fsMutex);
                return;
            }
            file.print(request->getParam("json", true)->value());
            file.close();
            xSemaphoreGive(fsMutex);
            tagRecord *taginfo = tagRecord::findByMAC(mac);
            if (taginfo != nullptr) {
                uint32_t ttl = 0;
                if (request->hasParam("ttl", true)) {
                    ttl = request->getParam("ttl", true)->value().toInt();
                }
                taginfo->modeConfigJson = "{\"filename\":\"/current/" + dst + ".json\",\"interval\":\"" + String(ttl) + "\"}";
                taginfo->contentMode = 19;
                taginfo->nextupdate = 0;
                wsSendTaginfo(mac, SYNC_USERCFG);
                request->send(200, "text/plain", "Ok, saved");
            } else {
                request->send(400, "text/plain", "mac not found in tagDB");
            }
        }
        return;
    }
    request->send(400, "text/plain", "Missing parameters");
}

void dotagDBUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index) {
        logLine("restore tagDB");
        xSemaphoreTake(fsMutex, portMAX_DELAY);
        request->_tempFile = contentFS->open("/current/tagDBrestored.json", "w");
    }
    if (len) {
        request->_tempFile.write(data, len);
    }
    if (final) {
        request->_tempFile.close();
        xSemaphoreGive(fsMutex);
        destroyDB();
        loadDB("/current/tagDBrestored.json");
        request->send(200, "text/plain", "Ok, restored.");
    }
}
